#Устанавливаем актуальный образ node.js
FROM node:21.5.0-alpine3.18

#Указываем корневую директорию приложения
WORKDIR /home/NewYearWish 

#Копируем файлы package.json и package-lock.json в корневую директорию
COPY package*.json ./ 

#Устанавливаем зависимости из package*.json
RUN npm install 

#Копируем остальной исходный код в рабочий каталог
COPY . . 

#Открываем порт 1837, который будет слушать наш сервис
EXPOSE 1837 
#Вводим в терминал команду, которая будет запускать веб-сервис
CMD [ "node", "Tange.js" ]

